Revit 2027 API
BuiltInFailures.ConnectorFailures.UnconnectedCircuit Property
 The element has an unconnected circuit on its connector
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnconnectedCircuit { get; }
Public Shared ReadOnly Property UnconnectedCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnconnectedCircuit {
	FailureDefinitionId^ get ();
}
static member UnconnectedCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace